[
    {
        "name": "Skills",
        "category": "skills",
        "order": 2,
        "entries": [
            {
                "name": "Software Development (General)",
                "blurb": "3 years of professional experience",
                "imagePath": "resume/logo-software.png",
                "description": [
                    "Experienced as a technical lead, full stack software engineer, and UX analyst.",
                    "Developed highly regarded enterprise software systems and a slew of personal projects including web applications, code generators, and simulation frameworks.",
                    "Delivered production systems using technologies including Ruby on Rails, Java EE, AngularJS, and Google Web Toolkit.",
                    "Experienced leading and mentoring teams of programmers on various projects.",
                    "Knowledge of development best practices, methodologies, tools, and techniques."
                ]
            },
            {
                "name": "Java / Java EE",
                "blurb": "3 years of professional experience",
                "imagePath": "resume/logo-java.png",
                "description": [
                    "Developed enterprise web applications, middleware/legacy system adapters, and a simulation/game framework.",
                    "Experienced with EE technology stack, including usage of EJB, JPA, and CDI.",
                    "Extensively used common APIs and frameworks including Google Web Toolkit (GWT), Apache Commons, JasperReports, and more.",
                    "Configured and deployed applications to various application servers, including JBoss and IBM's WebSphere."
                ]
            },
            {
                "name": "AngularJS",
                "blurb": "2 years of professional experience",
                "imagePath": "resume/logo-angularjs.png",
                "description": [
                    "Developed and delivered an enterprise-scale web application using an AngularJS front-end and REST back-end that was regarded by the State of Hawaii as a best-of-breed ERP replacement solution.",
                    "Architected, designed, and developed several personal web applications using AngularJS as the front-end.",
                    "Trained and mentored 6 other developers in learning the AngularJS framework and associated best practices."
                ]
            },
            {
                "name": "Ruby on Rails",
                "blurb": "3 months of professional experience",
                "imagePath": "resume/logo-rails.png",
                "description": [
                    "Currently developing an event platform with features including ticket sales, social media, collaborative tools, interactive dashboards, and location geocoding.",
                    "Developed personal web application using Rails as a REST backend."
                ]
            },
            {
                "name": "SQL",
                "blurb": "3 years of professional experience",
                "imagePath": "resume/logo-sql.png",
                "description": [
                    "Designed and implemented normalized, relational database architectures for multiple applications.",
                    "Developed database-driven applications.",
                    "Wrote and tested injection-safe queries and prepared statements for multiple applications. ",
                    "Familiar with server technologies including Oracle PL/SQL, IBM DB2, MySQL, and Apache Derby."
                ]
            },
            {
                "name": "Google Web Toolkit (GWT)",
                "blurb": "1 year of professional experience",
                "imagePath": "resume/logo-gwt.png",
                "description": [
                    "Architected, designed, and developed an enterprise record management system with a GWT front-end that was regarded by the State of Hawaii as a best-of-breed ERP replacement solution.",
                    "Created reusable widget libraries used to provide standardized functionality and look-and-feel across multiple web applications.",
                    "Trained and mentored other developers in understanding the GWT framework and associated best practices."
                ]
            },
            {
                "name": "Web Technologies",
                "blurb": "3 years of professional experience",
                "imagePath": "resume/logo-html.png",
                "description": [
                    "Designed and implemented multiple web static web sites using HTML and CSS (SASS/SCSS).",
                    "Developed several dynamic enterprise web applications using HTML/CSS/JS front-ends and Java backends.",
                    "Experienced with full stack development involving Javascript front-ends and REST/SOAP web service backends.",
                    "Implemented build scripts and integrated tools including Gulp, Grunt, SASS preprocessors, etc. into daily workflow."
                ]
            },
            {
                "name": "Python",
                "blurb": "6 months of professional experience",
                "imagePath": "resume/logo-python.png",
                "description": [
                    "Programmed software including client-server applications and a web service",
                    "Experienced with core Python 2.7.x libraries."
                ]
            }
        ]
    },
    {
        "name": "Education",
        "category": "education",
        "order": 3,
        "entries": [
            {
                "name": "Masters of Science in Information Systems",
                "blurb": "Hawaii Pacific University | Degree Incomplete",
                "imagePath": "resume/logo-hawaiipacificuniversity.png",
                "description": [
                    "4.00 out of 4.00 GPA",
                    "8 courses / 24 credits remaining"
                ]
            },
            {
                "name": "B.S. in Computer Science",
                "blurb": "Hawaii Pacific University | Graduated December 2012",
                "imagePath": "resume/logo-hawaiipacificuniversity.png",
                "description": [
                    "3.99 out of 4.00 GPA",
                    "Graduated Summa Cum Laude",
                    "Nominated valedictorian by the Department of Math and Computer Science"
                ]
            }
        ]
    },
    {
        "name": "Work Experience",
        "category": "experience",
        "order": 1,
        "entries": [
            {
                "name": "Implementation Lead (title: Software Engineer)",
                "blurb": "HNL.IO | August 2015 - Present",
                "imagePath": "resume/logo-hnlio.png",
                "description": [
                    "Lead the implementation of an event/collaboration platform using Ruby on Rails that will bring together event planners, service providers, venue owners, and attendees from multiple industries.",
                    "Promote and expand the technology industry in Hawaii by creating and acting on opportunities for collaboration with other industries."
                ]
            },
            {
                "name": "Technical Lead / Software Engineer (title: Systems Analyst)",
                "blurb": "eWorld Enterprise Solutions, Inc. | August 2013 - August 2015",
                "imagePath": "resume/logo-eworldes.png",
                "description": [
                    "Led a 4-member development team in creating enterprise-scale web applications using a variety of technologies.",
                    "Delivered 2 major applications that were recognized as best-of-breed solutions by the State of Hawaii.",
                    "Consulted as a subject-matter expert by other project teams in the organization for UX, architecture, and design.",
                    "Mentored junior developers, teaching them coding, best practices, technologies, and designs.",
                    "Championed technologies and practices which were adopted as organizational standards, including agile, automation, and professional development.",
                    "Technologies included AngularJS, Google Web Toolkit, Java EE (JPA+CDI+EJB+JAXRS), WebSphere, JBoss, DB2, Oracle."
                ]
            },
            {
                "name": "IT Technician (title: Technical Analyst Assistant)",
                "blurb": "Hawaii Pacific University | January 2011 - February 2013",
                "imagePath": "resume/logo-hawaiipacificuniversity.png",
                "description": [
                    "Worked directly with end-users and teammates to resolve 1000+ hardware, software, and network issues.",
                    "Monitored and maintained a computer lab with 100+ systems and 3500+ weekly users.",
                    "Trained and mentored 16 teammates in fulfilling relevant job responsibilities.",
                    "Created reports for management by analyzing datasets with 200,000+ elements."
                ]
            },
            {
                "name": "Computer Services Consultant",
                "blurb": "Freelance | January 2006 - Present",
                "description": [
                    "Provided independent computer services to dozens of long-term clients.",
                    "Consulted with clients and grave professional recommendations for technology purchases and decisions.",
                    "Deployed, secured, and optimized home Local Area Networks.",
                    "Custom built dozens of computer systems, including powerful gaming machines and reliable, efficient business PCs.",
                    "Performed hardware repairs, virus/malware removal, backup/data recovery services, and performance optimization for PCs."
                ]
            }
        ]
    },
    {
        "name": "Certifications and Professional Development",
        "category": "education",
        "order": 4,
        "entries": [
            {
                "name": "CompTIA Security+ CE",
                "blurb": "Certified from 2014 - 2017",
                "imagePath": "resume/logo-security-plus.png",
                "description": [
                    "License V2W06WTD4CBESEGR"
                ]
            },
            {
                "name": "SHAKACON VI Security Conference",
                "blurb": "Attended 2014",
                "imagePath": "resume/logo-shakacon.png",
                "description": [
                ]
            }
        ]
    }
]
